#
#1.
# x=c(2, -1, 3, 7, 0.5, 8)가 실행되었다 하자. 다음 물음을 R 언어로 답하시오.
#
#①6, 2, 4번째 원소를 동시에 찾아라.
#②x의 원소 중 0보다 큰 값을 찾아라.
#③짝수 원소들을 찾아라.
#④x에서 홀수원소를 찾아 제거하라.
#
#2.
# 다음과 같은 번호(ID), 성명(name), 성적(score)를 성분으로 하는 리스트가 있다.
# 물음에 답하라.
# L=list(ID=c(1,2,3), 
#      name=c('Kim', 'Lee', 'Park'),
#       score=c(80, 95, 75))
# ① length(L)은 얼마이며, 이것은 무엇을 의미하는가?
# ② 이름 성적 75을 80으로 수정하라.
# ③ L$name=='Park'의 결과를 쓰고, 무엇을 의미하는지 설명하라.
# ④ L$score[L$name=='Park']의 결과를 쓰고, 문장이 무엇을 의미하는지 설명하라.
# ⑤ 1번 학생의 이름과 성적을 알아내는 문장을 만들어 보아라.
